app/controllers/pokemons_controller.rb

SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = 3  [["trainer_id", 5], ["updated_at", "2015-03-29 05:00:03.241042"]]
---
  def capture
    @id = params[:id]
    @thepokemon = Pokemon.find(@id)
    @thepokemon.trainer = current_trainer
    @thepokemon.save

SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = 5  [["health", 90], ["updated_at", "2015-03-29 04:59:57.144100"]]
---
  def damage
    @id = params[:idPokemon]
    @thepokemon = Pokemon.find(@id)
    @thepokemon.health -= 10
    @thepokemon.save

INSERT INTO "pokemons" ("created_at", "health", "level", "name", "trainer_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-03-29 04:59:54.936263"], ["health", 100], ["level", 1], ["name", "Zachary Quinto"], ["trainer_id", 5], ["updated_at", "2015-03-29 04:59:54.936263"]]
---
  def create
    @pokemon = Pokemon.new(pokemon_params)
    @pokemon.health = 100
    @pokemon.level = 1
    @pokemon.trainer = current_trainer
    if @pokemon.save