app/views/trainers/show.html.erb

SELECT "pokemons".* FROM "pokemons"  WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 4]]
---
<p>Pokemons:</p>
<% @trainer.pokemons.each do |pokemon| %>